BlackVS/esp32-os/components/ESPmpu6886/MPU6886.cpp
#include "MPU6886.h"
#include <math.h>
#include "esp32_tools.h"


MPU6886::MPU6886(I2C_t& port, uint16_t dev_addr)
: m_port(port),
  m_dev_addr(dev_addr)
{

}

void MPU6886::I2C_Read_NBytes(uint8_t driver_Addr, uint8_t start_Addr, uint8_t number_Bytes, uint8_t *read_Buffer)
{
  m_port.readBytes(driver_Addr, start_Addr, number_Bytes, read_Buffer);
}

void MPU6886::I2C_Write_NBytes(uint8_t driver_Addr, uint8_t start_Addr, uint8_t number_Bytes, uint8_t *write_Buffer)
{
  m_port.writeBytes(driver_Addr, start_Addr, number_Bytes, write_Buffer);
}

int MPU6886::initialize(void)
{
  unsigned char tempdata[1];
  unsigned char regdata;
  
  m_port.begin();//initialize port
  
  I2C_Read_NBytes(MPU6886_ADDRESS, MPU6886_WHOAMI, 1, tempdata);
  if(tempdata[0] != 0x19)
    return -1;
  delay(1);
  
  regdata = 0x00;
  I2C_Write_NBytes(MPU6886_ADDRESS, MPU6886_PWR_MGMT_1, 1, &regdata);
  delay(10);

  //PWR1_DEVICE_RESET_BIT
  regdata = (0x01<<7);
  I2C_Write_NBytes(MPU6886_ADDRESS, MPU6886_PWR_MGMT_1, 1, &regdata);
  delay(10);

  regdata = (0x01<<0);
  I2C_Write_NBytes(MPU6886_ADDRESS, MPU6886_PWR_MGMT_1, 1, &regdata);
  delay(10);

  regdata = 0x10;
  I2C_Write_NBytes(MPU6886_ADDRESS, MPU6886_ACCEL_CONFIG, 1, &regdata);
  delay(1);

  regdata = 0x18;
  I2C_Write_NBytes(MPU6886_ADDRESS, MPU6886_GYRO_CONFIG, 1, &regdata);
  delay(1);

  regdata = 0x01;
  I2C_Write_NBytes(MPU6886_ADDRESS, MPU6886_CONFIG, 1, &regdata);
  delay(1);

  regdata = 0x05;
  I2C_Write_NBytes(MPU6886_ADDRESS, MPU6886_SMPLRT_DIV, 1,&regdata);
  delay(1);

  regdata = 0x00;
  I2C_Write_NBytes(MPU6886_ADDRESS, MPU6886_INT_ENABLE, 1, &regdata);
  delay(1);

  regdata = 0x00;
  I2C_Write_NBytes(MPU6886_ADDRESS, MPU6886_ACCEL_CONFIG2, 1, &regdata);
  delay(1);

  regdata = 0x00;
  I2C_Write_NBytes(MPU6886_ADDRESS, MPU6886_USER_CTRL, 1, &regdata);
  delay(1);

  regdata = 0x00;
  I2C_Write_NBytes(MPU6886_ADDRESS, MPU6886_FIFO_EN, 1, &regdata);
  delay(1);

  regdata = 0x22;
  I2C_Write_NBytes(MPU6886_ADDRESS, MPU6886_INT_PIN_CFG, 1, &regdata);
  delay(1);

  regdata = 0x01;
  I2C_Write_NBytes(MPU6886_ADDRESS, MPU6886_INT_ENABLE, 1, &regdata);

  delay(100);
  getGres();
  getAres();
  return 0;
}

void MPU6886::accelerationRaw(int16_t* ax, int16_t* ay, int16_t* az)
{

   uint8_t buf[6];  
   I2C_Read_NBytes(MPU6886_ADDRESS,MPU6886_ACCEL_XOUT_H,6,buf);
   
   *ax=((int16_t)buf[0]<<8)|buf[1];
   *ay=((int16_t)buf[2]<<8)|buf[3];
   *az=((int16_t)buf[4]<<8)|buf[5];

}

void MPU6886::rotationRaw(int16_t* gx, int16_t* gy, int16_t* gz)
{

  uint8_t buf[6];
  I2C_Read_NBytes(MPU6886_ADDRESS,MPU6886_GYRO_XOUT_H,6,buf);
  
  *gx=((uint16_t)buf[0]<<8)|buf[1];  
  *gy=((uint16_t)buf[2]<<8)|buf[3];  
  *gz=((uint16_t)buf[4]<<8)|buf[5];
  
}

void MPU6886::temperatureRaw(int16_t *t)
{
  
  uint8_t buf[2];  
  I2C_Read_NBytes(MPU6886_ADDRESS,MPU6886_TEMP_OUT_H,2,buf);
  
  *t=((uint16_t)buf[0]<<8)|buf[1];  
}



//!Pitch, yaw, roll: refers to the rotation state of the aircraft in three-dimensional space.
void MPU6886::getAhrsData(float *pitch,float *roll,float *yaw)
{
  float accX = 0; 
  float accY = 0;
  float accZ = 0;

  float gyroX = 0;
  float gyroY = 0;
  float gyroZ = 0;

  rotation(&gyroX,&gyroY,&gyroZ);
  acceleration(&accX,&accY,&accZ);
  
  MahonyAHRSupdateIMU(gyroX * DEG_TO_RAD, gyroY * DEG_TO_RAD, gyroZ * DEG_TO_RAD, accX, accY, accZ,pitch,roll,yaw);
}

void MPU6886::getGres()
{

   switch (Gyscale)
   {
  // Possible gyro scales (and their register bit settings) are:
     case GYRO_FS_250DPS:
           gRes = 250.0/32768.0;
           break;
     case GYRO_FS_500DPS:
           gRes = 500.0/32768.0;
           break;
     case GYRO_FS_1000DPS:
           gRes = 1000.0/32768.0;
           break;
     case GYRO_FS_2000DPS:
           gRes = 2000.0/32768.0;
           break;
   }

}


void MPU6886::getAres()
{
   switch (Acscale)
   {
   // Possible accelerometer scales (and their register bit settings) are:
   // 2 Gs (00), 4 Gs (01), 8 Gs (10), and 16 Gs  (11). 
   // Here's a bit of an algorith to calculate DPS/(ADC tick) based on that 2-bit value:
    case ACCEL_FS_2G:
          aRes = 2.0/32768.0;
          break;
    case ACCEL_FS_4G:
          aRes = 4.0/32768.0;
          break;
    case ACCEL_FS_8G:
          aRes = 8.0/32768.0;
          break;
    case ACCEL_FS_16G:
          aRes = 16.0/32768.0;
          break;
  }

}
 
void MPU6886::setGyroFullScale(Gscale scale)
{
    //return IIC_Write_Byte(MPU_GYRO_CFG_REG,scale<<3);//设置陀螺仪满量程范围
    unsigned char regdata;	
    regdata = (scale<<3);
    I2C_Write_NBytes(MPU6886_ADDRESS, MPU6886_GYRO_CONFIG, 1, &regdata);
    delay(10);

    Gyscale = scale;
    getGres();
}

void MPU6886::setAccelFullScale(Ascale scale)
{
    unsigned char regdata;	
    regdata = (scale<<3);
    I2C_Write_NBytes(MPU6886_ADDRESS, MPU6886_ACCEL_CONFIG, 1, &regdata);
    delay(10);

    Acscale = scale;
    getAres();
}




void MPU6886::acceleration(float* ax, float* ay, float* az)
{

  int16_t accX = 0;
  int16_t accY = 0;
  int16_t accZ = 0;
  accelerationRaw(&accX,&accY,&accZ);


  *ax = (float)accX * aRes;
  *ay = (float)accY * aRes;
  *az = (float)accZ * aRes;

}
      
void MPU6886::rotation(float* gx, float* gy, float* gz)
{
  int16_t gyroX = 0;
  int16_t gyroY = 0;
  int16_t gyroZ = 0;
  rotationRaw(&gyroX,&gyroY,&gyroZ);

  *gx = (float)gyroX * gRes;
  *gy = (float)gyroY * gRes;
  *gz = (float)gyroZ * gRes;
}

void MPU6886::temperatureC(float *t)
{
  
  int16_t temp = 0;
  temperatureRaw(&temp);
  
  *t = (float)temp / 326.8 + 25.0;
}



/**
 * @brief Test connection with MPU.
 * @details It reads the WHO_AM_IM register and check its value against the correct chip model.
 * @return
 *  - `ESP_OK`: The MPU is connected and matchs the model.
 *  - `ESP_ERR_NOT_FOUND`: A device is connect, but does not match the chip selected in _menuconfig_.
 *  - May return other communication bus errors. e.g: `ESP_FAIL`, `ESP_ERR_TIMEOUT`.
 * */
esp_err_t MPU6886::testConnection()
{
    const uint8_t wai = whoAmI();
    return (wai == 0x19) ? ESP_OK : ESP_ERR_NOT_FOUND;
}

/**
 * @brief Returns the value from WHO_AM_I register.
 */
uint8_t MPU6886::whoAmI()
{
    unsigned char tempdata[1];
    I2C_Read_NBytes(MPU6886_ADDRESS, MPU6886_WHOAMI, 1, tempdata);
        return tempdata[0];
}
